In [191]:
import numpy as np
import pandas as pd

In [192]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [193]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [194]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
top_5 = authors_price.sort_values(by='price', ascending=False).iloc[0:5, :]
top_5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [195]:
#authors_stat = pd.DataFrame({'min_price': [], 'max_price': [], 'mean_price': []})
#authors_stat1 = pd.merge(authors_price, authors_stat, on = index)

In [196]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [197]:
#a_max = authors_price.groupby('author_name').agg({'price': 'max'})
#b_min = authors_price.groupby('author_name').agg({'price': 'min'})
#c_mean = authors_price.groupby('author_name').agg({'price': 'mean'})
#merge = pd.merge(a_max, b_min, on = 'author_name', how = 'outer')
#authors_stat = pd.merge(authors_stat, c_mean, on = 'author_name', how = 'outer' )
#authors_stat

In [198]:
#authors_stat.rename(columns={'price_x': 'max_price', 'price_y': 'min_price', 'price': 'mean_price'})